Revit 2026 API

# BuiltInFailuresKeyBasedTreeEntryFailures Class

---

Failures about KeyBasedTreeEntry.

SystemObject Autodesk.Revit.DBBuiltInFailuresKeyBasedTreeEntryFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class KeyBasedTreeEntryFailures
```
```vb
Public NotInheritable Class KeyBasedTreeEntryFailures
```
```cpp
public ref class KeyBasedTreeEntryFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type KeyBasedTreeEntryFailures = class end
```

The BuiltInFailuresKeyBasedTreeEntryFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BadClassificationLevel | Level [Level] of Classification [Code] is not an integer from 1 to 5. |
|  | CircularParentage | A sub-[EntryType] '[Code]' specified as parent for its current ancestor '[Code]' |
|  | DuplicateEntry | Duplicate code '[Code]', description: '[Description]' |
|  | MissingParent | No parent [EntryType] '[Code]' for '[Code]' |

#### Reference

Autodesk.Revit.DB Namespace